app/views/bookings/new.html.erb

SELECT "events".* FROM "events"
---
    <%= form.label :event %><br>
    <%= collection_select( :booking, :event_id , Event.all, :id, :name) %>