app/views/users/index.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 16], ["LIMIT", 1]]
---

    <td><%= s.roles.first.name %></td>