app/views/users/new.html.erb

    <%= form.label :role_id %><br>
    <%=  collection_select(:user, :role_ids , Role.all, :id, :name) %>
---
SELECT "roles".* FROM "roles"