app/views/events/index.html.erb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT SUM("bookings"."capacity") FROM "bookings" WHERE "bookings"."event_id" = $1  [["event_id", 2]]
---
    <td><%= e.category.name %></td>
    <td><%= e.location.capacity - e.bookings.sum(:capacity) %></td>