app/views/events/new.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category %><br>
    <%=  collection_select( :event, :category_id , Category.all, :id, :name) %>

SELECT "locations".* FROM "locations"
---
    <%= form.label :location %><br>
    <%=  collection_select( :event, :location_id , Location.all, :id, :name) %>