app/controllers/bookings_controller.rb

  def index
    @bookings=Booking.all
---
SELECT "bookings".* FROM "bookings"

  def new
    @user =User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def show
    @booking = Booking.find(params[:format])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def confirm
    @booking = Booking.find(params[:booking_id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def cancel

    @booking =Booking.find(params[:booking_id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @user=User.find(params[:user_id])
    @booking = @user.bookings.new(booking_params)
    if @booking.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
INSERT INTO "bookings" ("status", "reason", "capacity", "created_at", "updated_at", "user_id", "event_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["status", 2], ["reason", nil], ["capacity", 10], ["created_at", "2022-06-21 11:27:04.908912"], ["updated_at", "2022-06-21 11:27:04.908912"], ["user_id", 22], ["event_id", 3]]