app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Movie"], ["created_at", "2022-06-20 11:51:28.982045"], ["updated_at", "2022-06-20 11:51:28.982045"]]
---
  def create

    @category = Category.new(category_params)

    if @category.save