app/controllers/events_controller.rb

  def index
    @events=Event.all
---
SELECT "events".* FROM "events"

  def create

    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "start_time", "end_time", "created_at", "updated_at", "category_id", "location_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"