app/controllers/locations_controller.rb

  def index
    @locations=Location.all
---
SELECT "locations".* FROM "locations"

  def create

    @location = Location.new(location_params)

    if @location.save
---
INSERT INTO "locations" ("name", "address", "capacity", "created_at", "updated_at", "city_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["address", ""], ["capacity", nil], ["created_at", "2022-06-20 08:40:23.746679"], ["updated_at", "2022-06-20 08:40:23.746679"], ["city_id", 1]]