app/controllers/notifications_controller.rb

  def index
    @notifications=Notification.all
---
SELECT "notifications".* FROM "notifications"