app/controllers/roles_controller.rb

  def index
    @roles=Role.all
---
SELECT "roles".* FROM "roles"

  def create

    @role=Role.new(role_params)
    if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2022-06-20 09:13:18.604030"], ["updated_at", "2022-06-20 09:13:18.604030"]]