app/controllers/users_controller.rb

def create

    @user = User.new(user_params)
    @user.roles << Role.find_by(id: params[:user][:role_ids])
    if @user.save
---
INSERT INTO "users" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["phone", ""], ["email", ""], ["created_at", "2022-06-20 05:34:11.506353"], ["updated_at", "2022-06-20 05:34:11.506353"]]
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "users" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "jhdihediuw"], ["phone", "6353003059"], ["email", "solankimonas12@gmail.com"], ["created_at", "2022-06-21 06:07:33.573830"], ["updated_at", "2022-06-21 06:07:33.573830"]]