app/models/event.rb

INSERT INTO "notifications" ("notifiable_type", "notifiable_id", "created_at", "updated_at", "message") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["notifiable_type", "Event"], ["notifiable_id", 3], ["created_at", "2022-06-21 10:17:52.440809"], ["updated_at", "2022-06-21 10:17:52.440809"], ["message", "Joog Joog jio Event Update"]]
---
    def create_notification
        self.notifications.create(message:"#{self.name} Event Update")