app/views/locations/new.html.erb

    <%= form.label :City %><br>
    <%=  collection_select( :location, :city_id , City.all, :id, :name) %>
---
SELECT "cities".* FROM "cities"